fluidisedBed_forces/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          2e-4;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           2;

maxDeltaT       0.01;

functions
{
    #includeFunc fieldAverage(U.particles, U.air, alpha.particles, p)
    
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        patches         (walls);
        
        p		 p_rgh;
        U		 U.air;
        
        // phase   	 air;
        
	rhoInf		 1;
	// error, current phase is compressible. However, can't use a numerical / scalar value. In other tutorial cases they used a scalar value but attempts here returns an error        
	rho             rhoInf; 
	log             yes;
	CofR            (0 0 0);
    }
}

// ************************************************************************* //
